app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts"
---
  def index
    @microposts = Micropost.all

INSERT INTO "microposts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "hi everyone"], ["created_at", "2022-02-24 10:33:02.871591"], ["updated_at", "2022-02-24 10:33:02.871591"]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save